# Advanced Querying Mongo

Importing libraries and setting up connection

In [1]:
from pymongo import MongoClient

In [2]:
str_conn = 'mongodb://localhost:27017'   # str_con por defecto

cursor = MongoClient(str_conn)

cursor

MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True)

### 1. All the companies whose name match 'Babelgum'. Retrieve only their `name` field.

In [3]:
cursor.list_database_names()

['admin', 'companies', 'config', 'local']

In [4]:
db = cursor.companies

In [5]:
colec = db.colection

In [6]:
list(colec.find().limit(1))

[{'_id': ObjectId('52cdef7c4bab8bd675297d8a'),
  'name': 'Wetpaint',
  'permalink': 'abc2',
  'crunchbase_url': 'http://www.crunchbase.com/company/wetpaint',
  'homepage_url': 'http://wetpaint-inc.com',
  'blog_url': 'http://digitalquarters.net/',
  'blog_feed_url': 'http://digitalquarters.net/feed/',
  'twitter_username': 'BachelrWetpaint',
  'category_code': 'web',
  'number_of_employees': 47,
  'founded_year': 2005,
  'founded_month': 10,
  'founded_day': 17,
  'deadpooled_year': 1,
  'tag_list': 'wiki, seattle, elowitz, media-industry, media-platform, social-distribution-system',
  'alias_list': '',
  'email_address': 'info@wetpaint.com',
  'phone_number': '206.859.6300',
  'description': 'Technology Platform Company',
  'created_at': datetime.datetime(2007, 5, 25, 6, 51, 27),
  'updated_at': 'Sun Dec 08 07:15:44 UTC 2013',
  'overview': '<p>Wetpaint is a technology platform company that uses its proprietary state-of-the-art technology and expertise in social media to build and monetize audiences for digital publishers. Wetpaint’s own online property, Wetpaint Entertainment, an entertainment news site that attracts more than 12 million unique visitors monthly and has over 2 million Facebook fans, is a proof point to the company’s success in building and engaging audiences. Media companies can license Wetpaint’s platform which includes a dynamic playbook tailored to their individual needs and comprehensive training. Founded by Internet pioneer Ben Elowitz, and with offices in New York and Seattle, Wetpaint is backed by Accel Partners, the investors behind Facebook.</p>',
  'image': {'available_sizes': [[[150, 75],
     'assets/images/resized/0000/3604/3604v14-max-150x150.jpg'],
    [[250, 125], 'assets/images/resized/0000/3604/3604v14-max-250x250.jpg'],
    [[450, 225], 'assets/images/resized/0000/3604/3604v14-max-450x450.jpg']]},
  'products': [{'name': 'Wikison Wetpaint', 'permalink': 'wetpaint-wiki'},
   {'name': 'Wetpaint Social Distribution System',
    'permalink': 'wetpaint-social-distribution-system'}],
  'relationships': [{'is_past': False,
    'title': 'Co-Founder and VP, Social and Audience Development',
    'person': {'first_name': 'Michael',
     'last_name': 'Howell',
     'permalink': 'michael-howell'}},
   {'is_past': False,
    'title': 'Co-Founder/CEO/Board of Directors',
    'person': {'first_name': 'Ben',
     'last_name': 'Elowitz',
     'permalink': 'ben-elowitz'}},
   {'is_past': False,
    'title': 'COO/Board of Directors',
    'person': {'first_name': 'Rob',
     'last_name': 'Grady',
     'permalink': 'rob-grady'}},
   {'is_past': False,
    'title': 'SVP, Strategy and Business Development',
    'person': {'first_name': 'Chris',
     'last_name': 'Kollas',
     'permalink': 'chris-kollas'}},
   {'is_past': False,
    'title': 'Board',
    'person': {'first_name': 'Theresia',
     'last_name': 'Ranzetta',
     'permalink': 'theresia-ranzetta'}},
   {'is_past': False,
    'title': 'Board Member',
    'person': {'first_name': 'Gus',
     'last_name': 'Tai',
     'permalink': 'gus-tai'}},
   {'is_past': False,
    'title': 'Board',
    'person': {'first_name': 'Len',
     'last_name': 'Jordan',
     'permalink': 'len-jordan'}},
   {'is_past': False,
    'title': 'Head of Technology and Product',
    'person': {'first_name': 'Alex',
     'last_name': 'Weinstein',
     'permalink': 'alex-weinstein'}},
   {'is_past': True,
    'title': 'CFO',
    'person': {'first_name': 'Bert',
     'last_name': 'Hogue',
     'permalink': 'bert-hogue'}},
   {'is_past': True,
    'title': 'CFO/ CRO',
    'person': {'first_name': 'Brian',
     'last_name': 'Watkins',
     'permalink': 'brian-watkins'}},
   {'is_past': True,
    'title': 'Senior Vice President, Marketing',
    'person': {'first_name': 'Rob',
     'last_name': 'Grady',
     'permalink': 'rob-grady'}},
   {'is_past': True,
    'title': 'VP, Technology and Product',
    'person': {'first_name': 'Werner',
     'last_name': 'Koepf',
     'permalink': 'werner-koepf'}},
   {'is_past': True,
    'title': 'VP Marketing',
    'person': {'first_name': 'Kevin',
     'last_name': 'Flaherty',
     'permalink': 'kevin-flaherty'}},
   {'is_past': True,
    'title': 'VP User Experience',
    'person': {'first_name': 'Alex',
     'last_name': 'Berg',
     'permalink': 'alex-berg'}},
   {'is_past': True,
    'title': 'VP Engineering',
    'person': {'first_name': 'Steve',
     'last_name': 'McQuade',
     'permalink': 'steve-mcquade'}},
   {'is_past': True,
    'title': 'Executive Editor',
    'person': {'first_name': 'Susan',
     'last_name': 'Mulcahy',
     'permalink': 'susan-mulcahy'}},
   {'is_past': True,
    'title': 'VP Business Development',
    'person': {'first_name': 'Chris',
     'last_name': 'Kollas',
     'permalink': 'chris-kollas'}}],
  'competitions': [{'competitor': {'name': 'Wikia', 'permalink': 'wikia'}},
   {'competitor': {'name': 'JotSpot', 'permalink': 'jotspot'}},
   {'competitor': {'name': 'Socialtext', 'permalink': 'socialtext'}},
   {'competitor': {'name': 'Ning by Glam Media', 'permalink': 'ning'}},
   {'competitor': {'name': 'Soceeo', 'permalink': 'soceeo'}},
   {'competitor': {'name': 'Yola', 'permalink': 'yola'}},
   {'competitor': {'name': 'SocialGO', 'permalink': 'socialgo'}},
   {'competitor': {'name': 'IslamNor', 'permalink': 'islamnor'}}],
  'providerships': [],
  'total_money_raised': '$39.8M',
  'funding_rounds': [{'id': 888,
    'round_code': 'a',
    'source_url': 'http://seattlepi.nwsource.com/business/246734_wiki02.html',
    'source_description': '',
    'raised_amount': 5250000,
    'raised_currency_code': 'USD',
    'funded_year': 2005,
    'funded_month': 10,
    'funded_day': 1,
    'investments': [{'company': None,
      'financial_org': {'name': 'Frazier Technology Ventures',
       'permalink': 'frazier-technology-ventures'},
      'person': None},
     {'company': None,
      'financial_org': {'name': 'Trinity Ventures',
       'permalink': 'trinity-ventures'},
      'person': None}]},
   {'id': 889,
    'round_code': 'b',
    'source_url': 'http://pulse2.com/2007/01/09/wiki-builder-website-wetpaint-welcomes-95m-funding/',
    'source_description': '',
    'raised_amount': 9500000,
    'raised_currency_code': 'USD',
    'funded_year': 2007,
    'funded_month': 1,
    'funded_day': 1,
    'investments': [{'company': None,
      'financial_org': {'name': 'Accel Partners',
       'permalink': 'accel-partners'},
      'person': None},
     {'company': None,
      'financial_org': {'name': 'Frazier Technology Ventures',
       'permalink': 'frazier-technology-ventures'},
      'person': None},
     {'company': None,
      'financial_org': {'name': 'Trinity Ventures',
       'permalink': 'trinity-ventures'},
      'person': None}]},
   {'id': 2312,
    'round_code': 'c',
    'source_url': 'http://www.accel.com/news/news_one_up.php?news_id=185',
    'source_description': 'Accel',
    'raised_amount': 25000000,
    'raised_currency_code': 'USD',
    'funded_year': 2008,
    'funded_month': 5,
    'funded_day': 19,
    'investments': [{'company': None,
      'financial_org': {'name': 'DAG Ventures', 'permalink': 'dag-ventures'},
      'person': None},
     {'company': None,
      'financial_org': {'name': 'Accel Partners',
       'permalink': 'accel-partners'},
      'person': None},
     {'company': None,
      'financial_org': {'name': 'Trinity Ventures',
       'permalink': 'trinity-ventures'},
      'person': None},
     {'company': None,
      'financial_org': {'name': 'Frazier Technology Ventures',
       'permalink': 'frazier-technology-ventures'},
      'person': None}]}],
  'investments': [],
  'acquisition': {'price_amount': 30000000,
   'price_currency_code': 'USD',
   'term_code': 'cash_and_stock',
   'source_url': 'http://allthingsd.com/20131216/viggle-tries-to-bulk-up-its-social-tv-business-by-buying-wetpaint/?mod=atdtweet',
   'source_description': ' Viggle Tries to Bulk Up Its Social TV Business by Buying Wetpaint',
   'acquired_year': 2013,
   'acquired_month': 12,
   'acquired_day': 16,
   'acquiring_company': {'name': 'Viggle', 'permalink': 'viggle'}},
  'acquisitions': [],
  'offices': [{'description': '',
    'address1': '710 - 2nd Avenue',
    'address2': 'Suite 1100',
    'zip_code': '98104',
    'city': 'Seattle',
    'state_code': 'WA',
    'country_code': 'USA',
    'latitude': 47.603122,
    'longitude': -122.333253},
   {'description': '',
    'address1': '270 Lafayette Street',
    'address2': 'Suite 505',
    'zip_code': '10012',
    'city': 'New York',
    'state_code': 'NY',
    'country_code': 'USA',
    'latitude': 40.7237306,
    'longitude': -73.9964312}],
  'milestones': [{'id': 5869,
    'description': "Wetpaint named in Lead411's Hottest Seattle Companies list",
    'stoned_year': 2010,
    'stoned_month': 6,
    'stoned_day': 8,
    'source_url': 'http://www.lead411.com/seattle-companies.html',
    'source_text': None,
    'source_description': 'LEAD411 LAUNCHES "HOTTEST SEATTLE COMPANIES" AWARDS',
    'stoneable_type': 'Company',
    'stoned_value': None,
    'stoned_value_type': None,
    'stoned_acquirer': None,
    'stoneable': {'name': 'Wetpaint', 'permalink': 'wetpaint'}},
   {'id': 8702,
    'description': 'Site-Builder Wetpaint Makes One For Itself, Using the Demand Media Playbook',
    'stoned_year': 2010,
    'stoned_month': 9,
    'stoned_day': 6,
    'source_url': 'http://mediamemo.allthingsd.com/20100906/site-builder-wetpaint-makes-one-for-itself-using-the-demand-media-playbook/',
    'source_text': None,
    'source_description': 'All Things D',
    'stoneable_type': 'Company',
    'stoned_value': None,
    'stoned_value_type': None,
    'stoned_acquirer': None,
    'stoneable': {'name': 'Wetpaint', 'permalink': 'wetpaint'}}],
  'video_embeds': [],
  'screenshots': [{'available_sizes': [[[150, 86],
      'assets/images/resized/0016/0929/160929v2-max-150x150.png'],
     [[250, 143], 'assets/images/resized/0016/0929/160929v2-max-250x250.png'],
     [[450, 258], 'assets/images/resized/0016/0929/160929v2-max-450x450.png']],
    'attribution': None}],
  'external_links': [{'external_url': 'http://www.geekwire.com/2011/rewind-ben-elowitz-wetpaint-ceo-building-type-media-company',
    'title': 'GeekWire interview: Rewind - Ben Elowitz, Wetpaint CEO, on building a new type of media company'},
   {'external_url': 'http://techcrunch.com/2012/06/17/search-and-social-how-two-will-soon-become-one/',
    'title': 'Guest post by CEO Ben Elowitz in TechCrunch'},
   {'external_url': 'http://allthingsd.com/20120516/what-to-expect-when-facebook-is-expecting-five-predictions-for-facebooks-first-public-year/',
    'title': 'Guest post by CEO Ben Elowitz in AllThingsD'},
   {'external_url': 'http://adage.com/article/digitalnext/facebook-biggest-player-advertising-s-540-billion-world/235708/',
    'title': 'Guest post by CEO Ben Elowitz in AdAge'},
   {'external_url': 'http://www.businessinsider.com/facebook-captures-14-percent-of-our-online-attention-but-only-4-percent-of-ad-spending-online-2012-6',
    'title': 'Guest post by CEO Ben Elowitz in Business Insider'},
   {'external_url': 'http://allfacebook.com/wetpaint-media-data_b75963',
    'title': 'AllFacebook coverage of Wetpaint'},
   {'external_url': 'http://adage.com/article/digital/celeb-site-wetpaint-shows-media-profit-facebook/237828/',
    'title': 'Profile of Wetpaint in Ad Age'},
   {'external_url': 'http://allthingsd.com/20121018/how-to-boost-your-facebook-traffic-tips-and-tricks-from-wetpaint/',
    'title': 'Interview with Wetpaint CEO Ben Elowitz in All Things D'},
   {'external_url': 'http://www.xconomy.com/seattle/2012/10/19/wetpaint-starts-licensing-its-facebook-based-media-distribution-tech/',
    'title': 'Profile of Wetpaint in Xconomy'}],
  'partners': []}]

In [7]:
res = colec.find().limit(1)

list(res)[0].keys()

dict_keys(['_id', 'name', 'permalink', 'crunchbase_url', 'homepage_url', 'blog_url', 'blog_feed_url', 'twitter_username', 'category_code', 'number_of_employees', 'founded_year', 'founded_month', 'founded_day', 'deadpooled_year', 'tag_list', 'alias_list', 'email_address', 'phone_number', 'description', 'created_at', 'updated_at', 'overview', 'image', 'products', 'relationships', 'competitions', 'providerships', 'total_money_raised', 'funding_rounds', 'investments', 'acquisition', 'acquisitions', 'offices', 'milestones', 'video_embeds', 'screenshots', 'external_links', 'partners'])

In [8]:
query = {'$or': [{'name': 'Babelgum'}
                 ]}


# por columnas, dame solo las dos columnas
select={'name': True, '_id': 0}

res = colec.find(query, select)

import pandas as pd

pd.DataFrame(res)

       name
0  Babelgum

### 2. All the companies that have more than 5000 employees. Limit the search to 20 companies and sort them by **number of employees**.

In [9]:
# Your Code
query = {'number_of_employees': {'$gte': 5000}}

select={'name': True, 'number_of_employees': True , '_id': 0}

res = colec.find(query, select).sort('number_of_employees', -1).limit(20)

pd.DataFrame(res)

                                          name  number_of_employees
0                                      Siemens               405000
1                                          IBM               388000
2                                       Toyota               320000
3                                       PayPal               300000
4   Nippon Telegraph and Telephone Corporation               227000
5                          Samsung Electronics               221726
6                                    Accenture               205000
7                    Tata Consultancy Services               200300
8                    Flextronics International               200000
9                                      Safeway               186000
10                                        Sony               180500
11                                          LG               177000
12                                        Ford               171000
13                                      Boeing               160000
14               Digital Equipment Corporation               140000
15                                       Nokia               125000
16                         MItsubishi Electric               107000
17                         MItsubishi Electric               107000
18                                     Comcast               100000
19                                 Bertelsmann               100000

### 3. All the companies founded between 2000 and 2005, both years included. Retrieve only the `name` and `founded_year` fields.

In [10]:
# Your Code
query = {'$and': [{'founded_year': {'$lte': 2005}},
                  {'founded_year': {'$gte': 2000}}]}

select={'name': True, 'founded_year': True, '_id': 0}


res = colec.find(query, select).limit(30)

pd.DataFrame(res)

               name  founded_year
0          Wetpaint          2005
1              Zoho          2005
2              Digg          2004
3          Facebook          2004
4         Omnidrive          2005
5       StumbleUpon          2002
6            Gizmoz          2003
7             Helio          2005
8             Plaxo          2002
9        Technorati          2002
10          AddThis          2004
11             Veoh          2004
12  Jingle Networks          2005
13           Meetup          2002
14         LifeLock          2005
15           Wesabe          2005
16        Jangl SMS          2005
17          SmugMug          2002
18            Jajah          2005
19            Skype          2003
20          YouTube          2005
21   Pando Networks          2004
22             Ikan          2003
23        delicious          2003
24            Topix          2002
25          Jobster          2004
26        Revision3          2005
27         AllPeers          2004
28           iSkoot          2005
29         AllofMP3          2000

### 4. All the companies that had a Valuation Amount of more than 100.000.000 and have been founded before 2010. Retrieve only the `name` and `ipo` fields.

In [11]:
# Your Code
query = {'$and': [{'ipo.valuation_amount': {'$gt': 10e8}},
                  {'founded_year': {'$lt': 2010}}]}


select={'name': True,'founded_year': True,  'ipo.valuation_amount': True , '_id': 0}

res = colec.find(query, select).sort('ipo.valuation_amount', -1).limit(40)

pd.DataFrame(res)

               name  founded_year                                   ipo
0              GREE          2004  {'valuation_amount': 108960000000.0}
1          Facebook          2004  {'valuation_amount': 104000000000.0}
2            Amazon          1994  {'valuation_amount': 100000000000.0}
3           Twitter          2006   {'valuation_amount': 18100000000.0}
4           Groupon          2008   {'valuation_amount': 12800000000.0}
5           Tencent          1998   {'valuation_amount': 11000000000.0}
6   Western Digital          1970    {'valuation_amount': 9430000000.0}
7          LinkedIn          2003    {'valuation_amount': 9310000000.0}
8      BMC Software          1980    {'valuation_amount': 6000000000.0}
9         Rackspace          1998    {'valuation_amount': 5440000000.0}
10            Baidu          1999    {'valuation_amount': 4000000000.0}
11      TripAdvisor          2000    {'valuation_amount': 3273770000.0}
12         HomeAway          2005    {'valuation_amount': 3000000000.0}
13           Zillow          2005    {'valuation_amount': 2550000000.0}
14          Nielsen          1922      {'valuation_amount': 1600000000}
15             Yelp          2004      {'valuation_amount': 1300000000}
16            Chegg          2005      {'valuation_amount': 1100000000}
17            Chegg          2005      {'valuation_amount': 1100000000}
18       Higher One          2000      {'valuation_amount': 1060000000}
19        OpenTable          1998      {'valuation_amount': 1050000000}

### 5. All the companies that have less than 1000 employees and have been founded before 2005. Order them by the number of employees and limit the search to 10 companies.

In [12]:
# Your Code
query = {'$and': [{'number_of_employees': {'$lt': 1000}},
                  {'founded_year': {'$lt': 2005}}]}


select={'number_of_employees': True,'founded_year': True,  '_id': 0}

res = colec.find(query, select).sort('number_of_employees', -1).limit(10)

pd.DataFrame(res)

   number_of_employees  founded_year
0                  974          2000
1                  948          1997
2                  931          1997
3                  903          1983
4                  900          1991
5                  900          1999
6                  881          1999
7                  800          1998
8                  800          1999
9                  800          2004

### 6. All the companies that don't include the `partners` field.

In [13]:
# Your Code
query = {'$nor': [{'partners': 0} ] }

select={'name': True,'partners': True, '_id': 0}

res = colec.find(query, select)

pd.DataFrame(res)

                      name partners
0                 Wetpaint       []
1                AdventNet       []
2                     Zoho       []
3                     Digg       []
4                 Facebook       []
...                    ...      ...
18796               Adhunk       []
18797           AfterLogic       []
18798          goBookmaker       []
18799  EnteGreat Solutions       []
18800            EnteGreat       []

[18801 rows x 2 columns]

### 7. All the companies that have a null type of value on the `category_code` field.

In [14]:
# Your Code
query = {'category_code':None }

select={'name': True,'category_code': True, '_id': 0}

res = colec.find(query, select)

pd.DataFrame(res)

              name category_code
0       Collective          None
1          Snimmer          None
2           KoolIM          None
3     Level9 Media          None
4          VidKing          None
...            ...           ...
2746        Nellix          None
2747      Cantimer          None
2748  cruisecritic          None
2749      Coloroot          None
2750      Geekdive          None

[2751 rows x 2 columns]

### 8. All the companies that have at least 100 employees but less than 1000. Retrieve only the `name` and `number of employees` fields.

In [15]:
# Your Code
query = {'$and': [{'number_of_employees': {'$lte': 1000}},
                  {'number_of_employees': {'$gte': 100}}]}

select={'name': True, 'number_of_employees': True, '_id': 0}


res = colec.find(query, select).limit(20)

pd.DataFrame(res)

            name  number_of_employees
0      AdventNet                  600
1        AddThis                  120
2          OpenX                  305
3       LifeLock                  644
4          Jajah                  110
5     Livestream                  120
6        Ustream                  250
7       iContact                  300
8           Yelp                  800
9    Dailymotion                  120
10       RockYou                  106
11         Meebo                  200
12    Eventbrite                  200
13           Box                  950
14       Conduit                  215
15        Redfin                  100
16         oDesk                  120
17  Simply Hired                  100
18      PhotoBox                  600
19   Spreadshirt                  230

### 9. Order all the companies by their IPO price in a descending order.

In [16]:
# Your Code
query = {}


select={'name': True, 'ipo.valuation_amount': True , '_id': True}

res = colec.find(query, select).sort('ipo.valuation_amount', -1).limit(20)

pd.DataFrame(res)

,_id,name,ipo
0,52cdef7e4bab8bd67529a8b4,GREE,{'valuation_amount': 108960000000.0}
1,52cdef7c4bab8bd675297d8e,Facebook,{'valuation_amount': 104000000000.0}
2,52cdef7c4bab8bd675297e7a,Amazon,{'valuation_amount': 100000000000.0}
3,52cdef7c4bab8bd675297d94,Twitter,{'valuation_amount': 18100000000.0}
4,52cdef7d4bab8bd675299d5d,Groupon,{'valuation_amount': 12800000000.0}
5,52cdef7c4bab8bd675298674,Tencent,{'valuation_amount': 11000000000.0}
6,52cdef7e4bab8bd67529b996,Western Digital,{'valuation_amount': 9430000000.0}
7,52cdef7c4bab8bd675297e0c,LinkedIn,{'valuation_amount': 9310000000.0}
8,52cdef7c4bab8bd67529859a,BMC Software,{'valuation_amount': 6000000000.0}
9,52cdef7c4bab8bd675298527,Rackspace,{'valuation_amount': 5440000000.0}
10,52cdef7c4bab8bd675298760,Baidu,{'valuation_amount': 4000000000.0}
11,52cdef7c4bab8bd6752981a7,TripAdvisor,{'valuation_amount': 3273770000.0}
12,52cdef7c4bab8bd6752982f6,HomeAway,{'valuation_amount': 3000000000.0}
13,52cdef7c4bab8bd67529800c,Zillow,{'valuation_amount': 2550000000.0}
14,52cdef7c4bab8bd675297f15,Nielsen,{'valuation_amount': 1600000000}
15,52cdef7c4bab8bd675297de0,Yelp,{'valuation_amount': 1300000000}
16,52cdef7d4bab8bd675299bd8,Chegg,{'valuation_amount': 1100000000}
17,52cdef7d4bab8bd67529984e,Chegg,{'valuation_amount': 1100000000}
18,52cdef7e4bab8bd67529a415,RPX Corporation,{'valuation_amount': 1096000000}
19,52cdef7c4bab8bd675298649,Higher One,{'valuation_amount': 1060000000}

### 10. Retrieve the 10 companies with more employees, order by the `number of employees`

In [17]:
# Your Code
query={}
select={'name': True, 'number_of_employees': True, '_id': 0}


res = colec.find(query, select).sort('number_of_employees', -1).limit(10)

pd.DataFrame(res)

                                         name  number_of_employees
0                                     Siemens               405000
1                                         IBM               388000
2                                      Toyota               320000
3                                      PayPal               300000
4  Nippon Telegraph and Telephone Corporation               227000
5                         Samsung Electronics               221726
6                                   Accenture               205000
7                   Tata Consultancy Services               200300
8                   Flextronics International               200000
9                                     Safeway               186000

### 11. All the companies founded on the second semester of the year. Limit your search to 1000 companies.

In [18]:
# Your Code
query = {'founded_month': {'$gt':6} }

select={'name': True,'founded_month': True, '_id': 0}

res = colec.find(query, select).limit(1000)

pd.DataFrame(res)

             name  founded_month
0        Wetpaint             10
1            Zoho              9
2            Digg             10
3       Omnidrive             11
4            eBay              9
..            ...            ...
995      LingusTV             12
996  AccountMaven              9
997      Chapatiz             10
998       YOOWALK             10
999   Data Domain             10

[1000 rows x 2 columns]

### 12. All the companies founded before 2000 that have an acquisition amount of more than 10.000.00

In [19]:
# Your Code
query = {'$and': [{'acquisition.price_amount': {'$gt': 1000000}},
                  {'founded_year': {'$lt': 2000}}]}


select={'name':True,'founded_year': True,'acquisition.price_amount': True,  '_id': 0}

res = colec.find(query, select).sort('acquisition.price_amount', -1).limit(10)

pd.DataFrame(res)

                           name  founded_year                     acquisition
0                   BEA Systems          1995  {'price_amount': 8500000000.0}
1                        Navteq          1985  {'price_amount': 8100000000.0}
2              Sun Microsystems          1982  {'price_amount': 7400000000.0}
3                         Pixar          1986  {'price_amount': 7400000000.0}
4                           LSI          1980  {'price_amount': 6600000000.0}
5        National Semiconductor          1959  {'price_amount': 6500000000.0}
6                     aQuantive          1997  {'price_amount': 6400000000.0}
7                Siebel Systems          1993  {'price_amount': 5850000000.0}
8                        Sybase          1984  {'price_amount': 5800000000.0}
9  Affiliated Computer Services          1988  {'price_amount': 5750000000.0}

### 13. All the companies that have been acquired after 2010, order by the acquisition amount, and retrieve only their `name` and `acquisition` field.

In [20]:
# Your Code
query ={'acquisitions.acquired_year': {'$gt': 2010}}

select={'name': True,'acquisition': True,  '_id': 0}

res = colec.find(query, select).sort('acquisition.price_amount', -1).limit(10)

pd.DataFrame(res)

                  name                                        acquisition
0                  LSI  {'price_amount': 6600000000.0, 'price_currency...
1                Sabre  {'price_amount': 4300000000.0, 'price_currency...
2  The Weather Channel  {'price_amount': 3500000000.0, 'price_currency...
3       SuccessFactors  {'price_amount': 3400000000.0, 'price_currency...
4     Qualcomm Atheros  {'price_amount': 3100000000.0, 'price_currency...
5           Sourcefire  {'price_amount': 2700000000.0, 'price_currency...
6                Skype  {'price_amount': 2600000000.0, 'price_currency...
7          ExactTarget  {'price_amount': 2500000000.0, 'price_currency...
8       Quest Software  {'price_amount': 2400000000.0, 'price_currency...
9                Taleo  {'price_amount': 1900000000, 'price_currency_c...

### 14. Order the companies by their `founded year`, retrieving only their `name` and `founded year`.

In [21]:
# Your Code
query={}
select={'name': True, 'founded_year': True, '_id': 0}


res = colec.find(query, select).sort('founded_year', -1).limit(10)

pd.DataFrame(res)

        name  founded_year
0      Wamba          2013
1     Gimigo          2013
2     Clowdy          2013
3      Fixya          2013
4       Fluc          2013
5   SEOGroup          2013
6       Pikk          2013
7   WhosCall          2013
8     iBazar          2013
9  Advaliant          2013

### 15. All the companies that have been founded on the first seven days of the month, including the seventh. Sort them by their `acquisition price` in a descending order. Limit the search to 10 documents.

In [29]:
# Your Code
query = {'founded_day': {'$lte':7} }

select={'name': True,'acquisition.price_amount': True, '_id': 0}

res = colec.find(query, select).sort('acquisition.price_amount', -1).limit(10)

pd.DataFrame(res)

                name                     acquisition
0           Netscape  {'price_amount': 4200000000.0}
1             PayPal    {'price_amount': 1500000000}
2             Zappos    {'price_amount': 1200000000}
3            Alibaba    {'price_amount': 1000000000}
4            Postini     {'price_amount': 625000000}
5             Danger     {'price_amount': 500000000}
6  Clearwell Systems     {'price_amount': 410000000}
7         PrimeSense     {'price_amount': 345000000}
8             Amobee     {'price_amount': 321000000}
9        BlueLithium     {'price_amount': 300000000}

### 16. All the companies on the 'web' `category` that have more than 4000 employees. Sort them by the amount of employees in ascending order.

In [30]:
# Your Code
query = {'$and': [{'category_code': 'web'},
                  {'number_of_employees': {'$gt': 4000}}]}


select={'name':True,'category_code': True,'number_of_employees': True,  '_id': 0}

res = colec.find(query, select).sort('number_of_employees', 1).limit(10)

pd.DataFrame(res)

                            name category_code  number_of_employees
0                        Expedia           web                 4400
1                            AOL           web                 8000
2                        Webkinz           web                 8657
3                        Rakuten           web                10000
4  Los Angeles Times Media Group           web                10000
5                        Groupon           web                10000
6                         Yahoo!           web                13600
7                           eBay           web                15000
8                       Experian           web                15500

### 17. All the companies whose acquisition amount is more than 10.000.000, and currency is 'EUR'.

In [56]:
# Your Code
query = {'$and': [{'acquisition.price_amount': {'$gt': 10e6}},
                  {'acquisition.price_currency_code': 'EUR'}]}


select={'name':True,'acquisition.price_amount': True, '_id': 0}

res = colec.find(query, select,).sort('acquisition.price_amount', 1).limit(1000)

df1=pd.DataFrame(res)
df1

                  name                  acquisition
0            Wayfinder   {'price_amount': 24000000}
1                  ZYB   {'price_amount': 31500000}
2    Greenfield Online   {'price_amount': 40000000}
3       BioMed Central   {'price_amount': 43400000}
4              Webedia   {'price_amount': 70000000}
5  Tuenti Technologies   {'price_amount': 70000000}
6              Apertio  {'price_amount': 140000000}

In [57]:
query = {'$and': [{'acquisition.price_amount': {'$gt': 10e6}},
                  {'acquisition.price_currency_code': 'EUR'}]}


select={'name':True,'acquisition.price_currency_code': True, '_id': 0}

res1 = colec.find(query, select,).sort('acquisition.price_amount', 1).limit(1000)

df2=pd.DataFrame(res1)
df2

                  name                     acquisition
0            Wayfinder  {'price_currency_code': 'EUR'}
1                  ZYB  {'price_currency_code': 'EUR'}
2    Greenfield Online  {'price_currency_code': 'EUR'}
3       BioMed Central  {'price_currency_code': 'EUR'}
4              Webedia  {'price_currency_code': 'EUR'}
5  Tuenti Technologies  {'price_currency_code': 'EUR'}
6              Apertio  {'price_currency_code': 'EUR'}

### 18. All the companies that have been acquired on the first trimester of the year. Limit the search to 10 companies, and retrieve only their `name` and `acquisition` fields.

In [58]:
# Your Code
query = {'acquisition.acquired_month': {'$lte':4} }

select={'name': True,'acquisition.acquired_month': True, '_id': 0}

res = colec.find(query, select).limit(10)

pd.DataFrame(res)

              name            acquisition
0      StumbleUpon  {'acquired_month': 4}
1             Kyte  {'acquired_month': 1}
2             Veoh  {'acquired_month': 4}
3  Jingle Networks  {'acquired_month': 4}
4       NetRatings  {'acquired_month': 2}
5           blogTV  {'acquired_month': 3}
6       Livestream  {'acquired_month': 1}
7        delicious  {'acquired_month': 4}
8          Jobster  {'acquired_month': 4}
9            Spock  {'acquired_month': 4}

# Bonus
### 19. All the companies that have been founded between 2000 and 2010, but have not been acquired before 2011.

In [26]:
# Your Code

### 20. All the companies that have been 'deadpooled' after the third year.

In [27]:
# Your Code